#pragma once 
#include "common.h" // 需要 Vec 定义
#include "aabb.h"
#include <string>
#include <vector>

// ======================================================================================
// 1. 基础枚举定义
// ======================================================================================

// [材质类型]
// 影响光线反弹的行为 (BSDF)
enum Refl_t { 
    DIFF, // 漫反射 (Diffuse): 朗伯余弦分布，模拟粗糙表面
    SPEC, // 镜面反射 (Specular): 完美反射，模拟镜子/金属
    REFR  // 折射 (Refractive): 斯涅尔定律 + 菲涅尔效应，模拟玻璃/水
};

// ======================================================================================
// 2. 物体结构体 (Object) - 极致内存布局优化
// ======================================================================================
// [优化策略]: 显存对齐 (Memory Alignment)
// GPU 读取显存的最佳粒度是 128位 (16字节)。
// 我们将所有 16字节对齐的 Vec 放在前面，将所有 4字节的标量 (float/int/enum) 放在最后凑整。
// 
// 这样排列后，Object 的大小正好是: 
// 16*6 (Vec) + 4*4 (Scalar) = 112 字节。
// 没有哪怕 1 个字节的 Padding 浪费！带宽利用率 100%。
// --------------------------------------------------------------------------------------
struct ALIGN(16) Object {
    Vec v0 = {0.0f, 0.0f, 0.0f};
    Vec v1 = {0.0f, 0.0f, 0.0f};
    Vec v2 = {0.0f, 0.0f, 0.0f};
    Vec albedo = {0.0f, 0.0f, 0.0f};
    Vec emission = {0.0f, 0.0f, 0.0f};

    float metallic = 0.0f;
    float roughness = 1.0f;
    float ior = 1.45f;
    float transmission = 0.0f;

    int tex_id = -1;
    
    float pad1 = 0.0f;
    float pad2 = 0.0f;
    float pad3 = 0.0f;
};

// ======================================================================================
// 3. 全局配置与相机
// ======================================================================================

// [相机参数]
// 这个结构体在每一帧开始时由 CPU 传给 GPU Kernel。
// 包含生成光线所需的所有几何信息。
struct CameraParams {
    Vec pos; // 相机世界坐标
    Vec cx;  // 成像平面 X 轴 (已包含 FOV 缩放)
    Vec cy;  // 成像平面 Y 轴 (已包含 FOV 缩放)
    Vec dir; // 相机朝向 (归一化)
    
    float lens_radius; // 光圈半径 (Aperture / 2)。0 为针孔相机。
    float focus_dist;  // 焦距。光线在何处汇聚。
};

// ======================================================================================
// 4. 场景管理接口
// ======================================================================================

// 这是一个纯 CPU 端的数据容器，负责管理资源的生命周期。
// 使用 std::vector 可以方便地动态添加物体。
struct Scene {
    std::vector<Object> objects;
    std::vector<std::string> texture_files;

    AABB world_bound;
};

// 工厂函数
Scene create_cornell_box();
